JimBoHa/esp32-p4-bacnet-switches/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# This Waveshare board uses the ESP32-P4 revision 0.x/1.x silicon family.
# ESP-IDF 5.5+ requires selecting it explicitly because it is not binary
# compatible with revision 3.x silicon.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Waveshare ESP32-P4-POE-ETH baseline used by its official examples.
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# ESP32-P4-POE-ETH carries 32 MB of onboard NOR flash.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# Monitor the input and BACnet tasks in addition to both idle tasks.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# ESP32-P4 internal EMAC connected to the board's IP101GRI PHY.
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_USE_SPI_ETHERNET=n

# Dual-slot authenticated HTTPS OTA with automatic rollback.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_OTA_HTTPS_ENABLED=y
CONFIG_OTA_HTTPS_PORT=443
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# BACnet/IP owns one UDP socket and needs directed-broadcast transmission.
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SO_REUSE=y

# Advertise only this Ethernet controller and its two implemented services.
# Query, browse, Wi-Fi, and console surfaces are intentionally excluded.
# mDNS 1.12.0 internally inspects two slots during duplicate detection.
CONFIG_MDNS_MAX_INTERFACES=2
CONFIG_MDNS_MAX_SERVICES=2
CONFIG_MDNS_ACTION_QUEUE_LEN=8
# CONFIG_MDNS_ENABLE_CONSOLE_CLI is not set
# CONFIG_MDNS_ENABLE_BROWSE is not set
# CONFIG_MDNS_MULTIPLE_INSTANCE is not set
# CONFIG_MDNS_PREDEF_NETIF_STA is not set
# CONFIG_MDNS_PREDEF_NETIF_AP is not set
CONFIG_MDNS_PREDEF_NETIF_ETH=y
